testutil/configtest/mutations/patches/03-evmrpc-checkrow-deleted.patch
diff --git a/evmrpc/config/config_fuzz_test.go b/evmrpc/config/config_fuzz_test.go
index ecde27fef..518a1c47e 100644
--- a/evmrpc/config/config_fuzz_test.go
+++ b/evmrpc/config/config_fuzz_test.go
@@ -132,7 +132,7 @@ func FuzzReadConfig(f *testing.F) {
 
 	f.Fuzz(func(t *testing.T, keyIdx uint, kind uint8, s string, n int64, b bool) {
 		spec := configtest.Pick(evmKeys, keyIdx)
-		configtest.CheckRow(t, "evm", readEVM, spec, fuzzing.ConfigValue(kind, s, n, b))
+		_ = spec
 	})
 }
 
