testutil/configtest/mutations/patches/06-giga-wiring-deleted.patch
diff --git a/giga/executor/config/config_fuzz_test.go b/giga/executor/config/config_fuzz_test.go
index 73f2ebad2..f9da386e7 100644
--- a/giga/executor/config/config_fuzz_test.go
+++ b/giga/executor/config/config_fuzz_test.go
@@ -60,7 +60,7 @@ func FuzzReadConfig(f *testing.F) {
 // with no [giga_executor] section at all resolves to the in-code defaults, not to
 // the zero value.
 func TestReadConfigAbsentKeysKeepDefaults(t *testing.T) {
-	configtest.CheckAbsent(t, "giga_executor", readGiga, config.DefaultConfig)
+	_ = readGiga
 }
 
 // TestDefaultsMatchTheRecordedValues pins the giga_executor defaults themselves.
@@ -70,7 +70,7 @@ func TestReadConfigAbsentKeysKeepDefaults(t *testing.T) {
 // compares them against testdata/giga_executor.golden, an independent recording, so a default that
 // moves shows the new value in a diff instead of passing silently.
 func TestDefaultsMatchTheRecordedValues(t *testing.T) {
-	configtest.CheckDefaults(t, "giga_executor", config.DefaultConfig)
+	_ = readGiga
 }
 
 // TestKeyNamesMatchTheRecordedNames pins the two key names themselves.
@@ -93,5 +93,5 @@ func TestKeyNamesMatchTheRecordedNames(t *testing.T) {
 // The exemption list is empty and has to stay reviewed rather than assumed: Config carries exactly
 // the two fields the manifest names, so a third one arriving without a row fails here.
 func TestManifestNamesEveryField(t *testing.T) {
-	configtest.CheckManifestCoversEveryField(t, "giga_executor", config.DefaultConfig, gigaKeys)
+	_ = readGiga
 }
