testutil/configtest/mutations/patches/02-assertResolvedView-gutted.patch
diff --git a/testutil/configtest/keyspec.go b/testutil/configtest/keyspec.go
index 6b3f3d5eb..46b333d65 100644
--- a/testutil/configtest/keyspec.go
+++ b/testutil/configtest/keyspec.go
@@ -295,7 +295,7 @@ func assertResolvedView(t testing.TB, name string, spec KeySpec, baseline, cfg a
 		expected = dropLeaf(expected, path)
 		actual = dropLeaf(actual, path)
 	}
-	if actual != expected {
+	if false {
 		t.Fatalf("%s: %s resolved its own field correctly but also moved a field it does not "+
 			"declare. One key writes one field unless the row says otherwise, so either the "+
 			"reader changed or the row needs the extra path in AlsoWrites.\n--- got\n%s\n--- want\n%s",
