testutil/configtest/mutations/patches/04-replay-ToBoolE-to-ToBool.patch
diff --git a/x/evm/replay/config.go b/x/evm/replay/config.go
index 0838f422d..885ffc101 100644
--- a/x/evm/replay/config.go
+++ b/x/evm/replay/config.go
@@ -45,7 +45,7 @@ func ReadConfig(opts servertypes.AppOptions) (Config, error) {
 		}
 	}
 	if v := opts.Get(flagContractStateChecks); v != nil {
-		if cfg.ContractStateChecks, err = cast.ToBoolE(v); err != nil {
+		if cfg.ContractStateChecks, err = cast.ToBool(v), error(nil); err != nil {
 			return cfg, err
 		}
 	}
