testutil/configtest/mutations/patches/08b-sink-null-returns-kv-same-arity.patch
diff --git a/sei-tendermint/internal/state/indexer/sink/sink.go b/sei-tendermint/internal/state/indexer/sink/sink.go
index 804557051..956076d47 100644
--- a/sei-tendermint/internal/state/indexer/sink/sink.go
+++ b/sei-tendermint/internal/state/indexer/sink/sink.go
@@ -33,7 +33,12 @@ func EventSinksFromConfig(cfg *config.Config, dbProvider config.DBProvider, chai
 		case indexer.NULL:
 			// When we see null in the config, the eventsinks will be reset with the
 			// nullEventSink.
-			return []indexer.EventSink{null.NewEventSink()}, nil
+			store, err := dbProvider(&config.DBContext{ID: "tx_index", Config: cfg})
+			if err != nil {
+				return nil, err
+			}
+			budget := indexer.NewScanBudget(cfg.RPC.MaxSearchScanBudget)
+			return []indexer.EventSink{kv.NewEventSink(store, budget)}, nil
 
 		case indexer.KV:
 			store, err := dbProvider(&config.DBContext{ID: "tx_index", Config: cfg})
